README.org
JayHop Helicopters 
Scheduler

* Static Pages
  
  : rails g controller static_pages home

  [[./app/views/static_pages/home.html.erb]]

* User accounts

** Devise

   Users has many rides

   Ride has one user

* Scheduler

** Rides

  : rails g scaffold Ride roundtrip:boolean time_start:datetime time_end:datetime 

  [[./Gemfile]]

  [[./app/assets/javascripts/application.js]]

  [[./app/assets/stylesheets/application.css.scss]]

  [[./app/views/rides/index.html.erb]]

  [[./app/views/rides/new.html.erb]]

  [[./app/assets/javascripts]]

  [[./app/models/ride.rb]]

  [[./app/controllers/rides_controller.rb]]

  [[./db/seeds.rb]]

  - [ ] associate with user

* Mailer
* Style

** Bootstrap

   [[./Gemfile]]

  : gem 'bootstrap-sass', '~> 3.2.0'
  : gem 'sass-rails', '>= 3.2'
  : gem 'autoprefixer-rails'
  
   [[./app/assets/stylesheets/bootstrap_and_customization.css.scss]]

  : @import "bootstrap-sprockets";
  : @import "bootstrap";

   [[./app/assets/javascripts/application.js]]

  : //= require jquery
  : //= require bootstrap-sprockets


** jQuery Datepicker

   [[./Gemfile]]

  : gem 'jquery-ui-rails'

   [[./app/assets/javascripts/application.js]]

  : //= require jquery.ui.all

   [[./app/assets/stylesheets/application.css.scss]]

  : *= require jquery.ui.all

* Config

  [[./Gemfile]]
  [[./config/routes.rb]]
  [[./app/assets/javascripts/application.js]]

* info

  shuttle services for nebraska swoop
  corporate charter: 800/hr
  swoop 180/hr

  matthew jones chief pilot
  phone
  email
