README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2014-10-15 Wed 13:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ander" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Static Pages</a></li>
<li><a href="#sec-2">2. User accounts</a>
<ul>
<li><a href="#sec-2-1">2.1. Devise</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Scheduler</a>
<ul>
<li><a href="#sec-3-1">3.1. Rides</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Mailer</a></li>
<li><a href="#sec-5">5. Style</a>
<ul>
<li><a href="#sec-5-1">5.1. Bootstrap</a></li>
<li><a href="#sec-5-2">5.2. jQuery Datepicker</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Config</a></li>
<li><a href="#sec-7">7. info</a></li>
</ul>
</div>
</div>
<p>
JayHop Helicopters 
Scheduler
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Static Pages</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
rails g controller static_pages home
</pre>

<p>
<a href="./app/views/static_pages/home.html.erb">./app/views/static_pages/home.html.erb</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User accounts</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Devise</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Users has many rides
</p>

<p>
Ride has one user
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Scheduler</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Rides</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
rails g scaffold Ride roundtrip:boolean time_start:datetime time_end:datetime 
</pre>

<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<p>
<a href="./app/assets/stylesheets/application.css.scss">./app/assets/stylesheets/application.css.scss</a>
</p>

<p>
<a href="./app/views/rides/index.html.erb">./app/views/rides/index.html.erb</a>
</p>

<p>
<a href="./app/views/rides/new.html.erb">./app/views/rides/new.html.erb</a>
</p>

<p>
<a href="./app/assets/javascripts">./app/assets/javascripts</a>
</p>

<p>
<a href="./app/models/ride.rb">./app/models/ride.rb</a>
</p>

<p>
<a href="./app/controllers/rides_controller.rb">./app/controllers/rides_controller.rb</a>
</p>

<p>
<a href="./db/seeds.rb">./db/seeds.rb</a>
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> associate with user
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mailer</h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Style</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Bootstrap</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
gem 'bootstrap-sass', '~&gt; 3.2.0'
gem 'sass-rails', '&gt;= 3.2'
gem 'autoprefixer-rails'
</pre>

<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>
</p>

<pre class="example">
@import "bootstrap-sprockets";
@import "bootstrap";
</pre>

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require jquery
//= require bootstrap-sprockets
</pre>
</div>
</div>


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> jQuery Datepicker</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="./Gemfile">./Gemfile</a>
</p>

<pre class="example">
gem 'jquery-ui-rails'
</pre>

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require jquery.ui.all
</pre>

<p>
<a href="./app/assets/stylesheets/application.css.scss">./app/assets/stylesheets/application.css.scss</a>
</p>

<pre class="example">
*= require jquery.ui.all
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Config</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="./Gemfile">./Gemfile</a>
<a href="./config/routes.rb">./config/routes.rb</a>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> info</h2>
<div class="outline-text-2" id="text-7">
<p>
shuttle services for nebraska swoop
corporate charter: 800/hr
swoop 180/hr
</p>

<p>
matthew jones chief pilot
phone
email
</p>
</div>
</div>
</div>
</body>
</html>
